---
name: instruction-sync
description: >
  Синхронизирует инструкции из любого документа (PDF, DOCX, TXT, MD и др.) с GitHub-репозиторием Aqua Delivery.
  Используй этот скилл ВСЕГДА, когда пользователь: загружает документ с инструкциями и упоминает GitHub или репозиторий;
  просит "добавить инструкцию в репо", "обновить инструкции", "создать PR", "проверить что есть в репозитории";
  говорит что инструкция неверная, неполная или её нет; хочет синхронизировать, актуализировать или залить инструкции.
  Триггеры: загрузка любого файла + "репозиторий", "GitHub", "инструкция"; слова "создать PR", "обновить репо",
  "залить инструкцию", "что есть в репозитории", "добавь в базу знаний", "aqua-delivery-instructions".
---

# Instruction Sync — Aqua Delivery

Скилл для синхронизации инструкций с GitHub-репозиторием `victor11555/aqua-delivery-instructions`.

**Репозиторий:** `https://github.com/victor11555/aqua-delivery-instructions/tree/main`

---

## Что делает

Синхронизирует инструкции из пользовательских документов с GitHub-репозиторием `victor11555/aqua-delivery-instructions`. Проверяет, что уже есть в репозитории, диагностирует проблемы (устарело, неполное, отсутствует) и создаёт Pull Request с актуальной версией.

---

## Входные данные

Один или несколько из следующего:

- **Документ с инструкцией** — файл в любом формате: `.md`, `.txt`, `.pdf`, `.docx`, `.xlsx`
- **Контекст от пользователя** — фраза вроде "добавь в репозиторий", "обнови инструкцию", "создай PR", "проверь что есть в репо"
- **Уточнения по процессу** — пользователь отвечает на вопросы скилла о том, как правильно работает описываемый процесс

---

## Выходные данные

- Pull Request в репозиторий `victor11555/aqua-delivery-instructions` с новым или обновлённым `.md` файлом
- Ссылка на PR в ответе
- PR содержит описание: что изменено, почему, отметку что шаги согласованы с пользователем

---

## Обзор алгоритма

```
[1. Читаем документ] → [2. Ищем в репо] → [3. Диагностируем] → [4. Уточняем у пользователя] → [5. Пишем инструкцию] → [6. Ждём подтверждения] → [7. Создаём PR]
```

---

## Шаг 1 — Читаем документ пользователя

Определи формат файла и прочитай содержимое:

- `.md`, `.txt` — читай напрямую через `view` или `bash cat`
- `.pdf` — читай через `bash_tool`: `pdftotext /mnt/user-data/uploads/file.pdf -`
- `.docx` — через `bash_tool`: `python3 -c "import docx; d=docx.Document('/mnt/user-data/uploads/file.docx'); [print(p.text) for p in d.paragraphs]"`
- `.xlsx` — через `bash_tool`: `python3 -c "import openpyxl; ..."`

Если не знаешь формат — читай `/mnt/skills/public/file-reading/SKILL.md`.

Извлеки из документа:
- Список тем / процессов, которые описаны
- Ключевые шаги и команды
- На что похожа каждая инструкция (что она описывает)

---

## Шаг 2 — Изучаем репозиторий через MCP GitHub

Используй MCP GitHub для получения списка файлов:

```
Репозиторий: victor11555/aqua-delivery-instructions
Ветка: main
```

**Действия:**
1. Получи список всех `.md` файлов в репозитории
2. Для каждой темы из документа — найди совпадение по названию или содержимому
3. Прочитай найденные файлы целиком

**Явно сформулируй результат для каждой инструкции:**
- `✅ Нашёл, инструкция актуальная` → ничего не делать
- `⚠️ Нашёл, но инструкция неверная` → переписать
- `⚠️ Нашёл, но инструкция неполная` → дополнить или переписать
- `❌ Не нашёл — нужно создать`

---

## Шаг 3 — Диагностика: три состояния

### Состояние 1: Инструкция неверная → переписать
Признаки:
- Команды устарели или не работают
- Логика шагов нарушена
- Результат недостижим по описанным шагам

**Решение:** переписать полностью, сохранив имя файла.

### Состояние 2: Инструкция неполная → дополнить или переписать
Признаки:
- Пропущены шаги или зависимости
- Нет примеров результата
- Есть «предполагается» вместо явных действий
- Нет блока «если не работает»

**Решение:** дополнить недостающее. Если дополнений много — переписать.

### Состояние 3: Инструкции нет → создать с нуля
Признаки:
- Ни одного релевантного файла не нашёл
- Пользователь подтверждает, что её нет

**Решение:** создать новый `.md` файл.

---

## Шаг 4 — Уточняем у пользователя (ОБЯЗАТЕЛЬНО перед написанием)

**Никогда не пиши инструкцию без уточнений.**

Задай пользователю минимум эти вопросы (одним сообщением, без лишнего):

```
Перед тем как писать / переписывать инструкцию «{тема}», уточни:

1. Как правильно выполняется этот процесс в Aqua Delivery?
2. Какие шаги / настройки точно рабочие?
3. Где чаще всего возникают ошибки?
4. Что важно не забыть?
```

**Если пользователь отвечает размыто:**
→ Предложи конкретный вариант шага и уточни: «Правильно понимаю, что шаг выглядит так: ...?»

**Если пользователь не уверён:**
→ Сформируй черновик и попроси подтвердить: «Вот черновик — проверь, всё верно?»

---

## Шаг 5 — Формируем инструкцию

### Обязательная структура каждой инструкции:

```markdown
# {Название процесса}

## Когда применяется
{Одна фраза: в каких ситуациях нужна эта инструкция}

## Предусловия
- {Что должно быть настроено / установлено до начала}
- {Зависимости, доступы, роли}

## Пошаговый процесс

1. {Шаг один — конкретное действие}
   ```
   {команда или настройка, готовая к копированию}
   ```

2. {Шаг два}
   ...

## Пример результата
{Что пользователь увидит / получит после успешного выполнения}

## Если не работает

| Симптом | Причина | Решение |
|---------|---------|---------|
| {описание проблемы} | {почему} | {как исправить} |
```

### Принципы написания:
- Инструкция должна работать **с нуля**, без дополнительных вопросов
- Нет скрытых шагов и неявных знаний
- Команды — готовые к копированию, не абстрактные
- Частично сломанная → лучше переписать полностью
- Непонятная → упростить
- Зависит от неявных знаний → раскрыть явно

### Запрещено:
- Придумывать шаги без подтверждения пользователя
- Оставлять «предполагается», «обычно», «как правило»
- Давать предположительные команды

---

## Шаг 6 — Показываем черновик и ждём подтверждения

Всегда выводи черновик в формате:

```
Черновик — {filename}.md

{полная инструкция}

---
Что сделано: переписано / дополнено / создано с нуля
Почему: {что было не так — конкретно}

Создать PR? Жди «да», «ок» или «go ahead».
```

**⛔ Pull Request создавать ТОЛЬКО после явного подтверждения пользователя.**

Принимаемые ответы: `да`, `ок`, `ok`, `go ahead`, `создавай`, `давай`, `push`.

---

## Шаг 7 — Создаём Pull Request через MCP GitHub

После получения подтверждения:

1. **Создай ветку** с именем: `update/{filename-без-расширения}` или `create/{filename-без-расширения}`
2. **Закоммить файл** в новую ветку (создать или обновить `.md` файл)
3. **Открой Pull Request** в `main` со следующим описанием:

```
## Что изменено
{переписано / дополнено / создано}

## Причина
{что было не так / чего не хватало}

## Проверено с пользователем
✅ Шаги подтверждены
✅ Черновик согласован
```

После создания PR — выведи ссылку пользователю.

---

## Главный принцип

> Если по инструкции нельзя дойти до результата — она считается сломанной.
> Задача — сделать так, чтобы по ней можно было пройти **с первого раза**.
